{
  "title": "Katana Racing's 2025 Lineup: Gasly in, Hirakawa Out?",
  "text": "The 2024 Formula 1 season is only five races old, but the driver market for 2025 is already heating up — and Katana Racing is at the center of the latest rumor mill. According to multiple sources in the paddock, the new American team may be exploring a shock move to sign **Pierre Gasly**, potentially replacing rookie **Ryo Hirakawa** after just one season.\r\n\r\nWhile no formal statements have been made by the team, whispers began in the **Shanghai paddock** and gained momentum following Gasly’s underwhelming start to the season at Alpine, combined with Katana’s early performance struggles.\r\n\r\n---\r\n\r\n### Hirakawa's Struggles Raising Questions\r\n\r\n**Ryo Hirakawa**, 30, made the leap to F1 this year after a decorated career in endurance racing and Super Formula. However, the transition has proven difficult. Through five races, he sits **21st in the Drivers' Championship**, with two DNFs and no finishes higher than 20th. In contrast, teammate **Daniel Ricciardo** has consistently hovered around the top 12.\r\n\r\nSources close to the team suggest that while **Ken Tanaka**, Katana’s Team Principal, personally backed Hirakawa’s appointment, patience may be wearing thin among the ownership group and technical staff.\r\n\r\n> “There’s huge respect for Ryo’s background and professionalism, but F1 is brutal. The learning curve has been steeper than expected,”  \r\n> — one source told *F1GN* under the condition of anonymity.\r\n\r\n---\r\n\r\n### Why Pierre Gasly?\r\n\r\nGasly, currently racing for **Alpine**, is understood to be **out of contract at the end of 2024**. While Alpine has publicly backed him, internal frustrations have reportedly surfaced amid the team’s continued struggles and internal reshuffling.\r\n\r\nA move to Katana could offer a **fresh start — and a leadership role** — for the 28-year-old Frenchman, who won the **2020 Italian Grand Prix** and is still considered one of the sport’s most talented midfield drivers.\r\n\r\n> “Gasly would bring a mix of speed, experience, and edge that Katana might be missing alongside Ricciardo,”  \r\n> — said former F1 strategist **Rob Smedley** on *Sky Sports*.  \r\n> “If they want to take a step forward in 2025, it’s a logical move.”\r\n\r\n---\r\n\r\n### The Tanaka-Gasly Connection\r\n\r\nAdding fuel to the fire is the **existing relationship** between Gasly and **Ken Tanaka**, who briefly worked with the French driver during his junior years at Red Bull and later consulted for Honda-powered programs. The two are said to have mutual respect — and shared ambitions for bringing a *“cutting-edge but grounded”* racing philosophy to life.\r\n\r\nWhether that translates into a formal offer remains to be seen, but multiple insiders claim **initial contact** has already been made between **Gasly’s management and Katana Racing** in recent weeks.\r\n\r\n---\r\n\r\n### What’s Next for Hirakawa?\r\n\r\nIf Katana decides to move on from Hirakawa, his options within F1 could be limited. However, a return to **Toyota’s WEC program** — where he remains highly respected — could offer a **graceful landing spot**. Alternatively, he could be retained as a **reserve or development driver**, particularly given his technical feedback and popularity among Japanese fans.\r\n\r\n**Ken Tanaka** has remained silent on the rumors so far, only saying after the Chinese Grand Prix:\r\n\r\n> “We’re focused on performance. All driver conversations are internal for now.”\r\n\r\n---\r\n\r\n### Silly Season Starts Early\r\n\r\nWith several midfield seats in flux and experienced drivers like **Valtteri Bottas, Esteban Ocon**, and **Kevin Magnussen** also potentially on the move, Katana’s decision could trigger a **ripple effect** in the driver market.\r\n\r\nFor now, all eyes are on **Miami next weekend** — and whether Hirakawa can respond on track to keep his seat in the **fast-sharpening world of Formula 1**.\r\n",
  "author": "Laura DeWitt",
  "date": "2024-05-02",
  "slug": "katana-racings-2025-lineup-gasly-in-hirakawa-out",
  "image": "https://www.kymillman.com/wp-content/uploads/f1/pages/driver-profiles/pierre-gasly/pierre-gasly-1.jpg"
}